Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Search GdipSetPenWidth in MSDN Library
fr: Cherchez GdipSetPenWidth dans la Library MSDN.

source: Create a $tagGDIPRECTF structure
fr: Crée une structure $tagGDIPRECTF

source: X coordinate of upper left hand corner of rectangle
fr: Coordonnée X du coin supérieur gauche du rectangle

source: Y coordinate of upper left hand corner of rectangle
fr: Coordonnée Y du coin supérieur gauche du rectangle

source: Rectangle width
fr: Largeur du rectangle

source: Rectangle height
fr: Hauteur du rectangle

source: Returns a $tagGDIPRECTF structure.
fr: Retourne une structure $tagGDIPRECTF.

source: Clones a Region object
fr: Clone un objet région (Region)

source: Pointer to a Region object to be cloned
fr: Handle de l'objet Region à cloner

source: a pointer to a new cloned Region object.
fr: Retourne le handle du nouvel objet Region cloné.

source: After you are done with the object, call _GDIPlus_RegionDispose() to release the object resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_RegionDispose() pour libérer les ressources de l'objet.

source: Search GdipCloneRegion in MSDN Library
fr: Consultez GdipCloneRegion dans la Librairie MSDN.

source: 1 sub 2
fr: 1 moins 2

source: 2 sub 1
fr: 2 moins 1

source: Updates a region to the portion of itself that intersects the specified path's interior
fr: Modifie une région (Region) avec la partie d'elle-même qui coupe l'intérieur d'un tracé spécifié (GraphicsPath)

source: Pointer to a Region object
fr: Handle de l'objet Region

source: Pointer to a GraphicsPath object that specifies the path to use to update the region
fr: Handle de l'objet GraphicsPath qui spécifie le tracé à utiliser pour modifier la région

source: Combine mode that specifies how the region is combined with the path:
fr: Mode de combinaison qui spécifie comment la région est combinée avec le tracé:

source: 3 - The existing region is replaced by the result of performing an XOR on the two regions.
fr: 3 - Xor: la région existante est remplacée par le résultat de l'exécution d'un OU exclusif sur les deux régions.

source: A point is in the XOR of two regions if it is in one region or the other but not in both regions
fr: Un point est dans le OU exclusif de deux régions si il est dans une région ou l'autre mais pas dans les deux régions.

source: Search GdipCombineRegionPath in MSDN Library
fr: Consultez GdipCombineRegionPath dans la Librairie MSDN.

source: Set window background color to blue
fr: Régle la couleur de fond de la fenêtre à bleu

source: Get windowsize
fr: Obtient windowsize

source: Create region from a rectangle
fr: Crée une région à partir d'un rectangle

source: Combine rectangle_left AND rectangle_right
fr: Combine rectangle_left ET rectangle_right

source: Combine rectangles XOR string
fr: Combine-XOR les rectangles qui délimitent les chaînes

source: Create GDI region from GDI+ region
fr: Crée une région GDI à partir d'une région GDI+

source: Set window region
fr: Définit une région partie de la fenêtre

source: Updates a region to the portion of itself that intersects the specified rectangle's interior
fr: Modifie une région (Region) avec la partie d'elle-même qui coupe l'intérieur du rectangle spécifié

source: Combine mode that specifies how the region is combined with the rectangle:
fr: Mode de combinaison qui spécifie comment la région est combinée avec le tracé:

source: Search GdipCombineRegionRect in MSDN Library
fr: Consultez GdipCombineRegionRect dans la Librairie MSDN.

source: Updates a region to the portion of itself that intersects another region
fr: Modifie une région (Region) avec la partie d'elle-même qui coupe une autre région

source: Pointer to a Region object to use to update the $hRegionDst Region object
fr: Handle de l'objet Region source à utiliser pour modifier l'objet Region destination $hRegionDst

source: Combine mode that specifies how the regions are combined:
fr: Mode de combinaison qui spécifie comment la région est combinée avec le tracé:

source: Search GdipCombineRegionRegion in MSDN Library
fr: Consultez GdipCombineRegionRegion dans la Librairie MSDN.

source: Creates a region that is defined by a path object and has a fill mode that is contained in the path object
fr: Crée une région (Region) définie par un tracé (GraphicsPath) et qui a un mode de remplissage qui est celui du tracé

source: a pointer to a new Region object.
fr: Retourne le handle du nouvel objet Region.

source: Search GdipCreateRegionPath in MSDN Library
fr: Consultez GdipCreateRegionPath dans la Librairie MSDN.

source: Creates a region that is defined by a rectangle
fr: Crée une région (Region) définie par l'intérieur d'un rectangle

source: a handle to a new Region object.
fr: Retourne le handle du nouvel objet Region.

source: Search GdipCreateRegionRect in MSDN Library
fr: Consultez GdipCreateRegionRect dans la Librairie MSDN.

source: Releases a Region object
fr: Libère un objet Region

source: Search GdipDeleteRegion in MSDN Library
fr: Consultez GdipDeleteRegion dans la Librairie MSDN.

source: Gets a rectangle that encloses a region
fr: Retourne un rectangle qui entoure une région donnée

source: Pointer to a Graphics object that contains the world and page transformations required to calculate the device coordinates of the region and the rectangle
fr: Handle de l'objet Graphics qui contient les transformations nécessaires pour calculer les conversions des coordonnées uiverselles en coordonnées du périphérique pour la région et le rectangle

source: Search GdipGetRegionBounds in MSDN Library
fr: Consultez GdipGetRegionBounds dans la Librairie MSDN.

source: Creates a GDI region from a GDI+ Region object
fr: Crée un objet Region GDI à partir d'un objet Region GDI+

source: Pointer to a Graphics object that contains the world and page transformations required to calculate the device coordinates of the region
fr: Handle de l'objet Graphics qui contient les transformations nécessaires pour convertir les coordonnées universelles en coordonnées du périphérique pour la région

source: a handle to a GDI region (HRGN) object.
fr: Retourne le handle de l'objet Region GDI (HRGN).

source: Search GdipGetRegionHRgn in MSDN Library
fr: Consultez GdipGetRegionHRgn dans la Librairie MSDN.

source: Tansforms a region by multiplying each of its data points by a specified matrix
fr: Tansforme un objet Region en multipliant chacun de ses points de données par une matrice spécifiée

source: Pointer to a matrix that specifies the transformation
fr: Handle de la matrice de transformation

source: Search GdipTransformRegion in MSDN Library
fr: Consultez GdipTransformRegion dans la Librairie MSDN.

source: Offsets a region by specified amounts in the horizontal and vertical directions
fr: Translate un objet Region d'un vecteur spécifié

source: Real number that specifies the amount to shift the region in the X direction
fr: Nombre décimal qui indique le nombre de pixels de décalage dans la direction X.

source: Real number that specifies the amount to shift the region in the Y direction
fr: Nombre décimal qui indique le nombre de pixels de décalage dans la direction Y.

source: Search GdipTranslateRegion in MSDN Library
fr: Consultez GdipTranslateRegion dans la Librairie MSDN.

source: Clean up resources used by Microsoft Windows GDI+
fr: Nettoie les ressources utilisées par Microsoft Windows GDI+

source: You must dispose of all of your GDI+ objects before you call _GDIPlus_Shutdown().
fr: Vous devez libèrer la totalité de vos objets GDI+ avant d'appeler _GDIPlus_Shutdown() .

source: Search GdiplusShutdown in MSDN Library
fr: Consultez GdiplusShutdown dans la Librairie MSDN.

source: Initialize Microsoft Windows GDI+
fr: Initialise Microsoft Windows GDI+

source: the filename of the dll to be used.
fr: Le nom du fichier de la DLL à utiliser.

source: Default is the installed GDI Dll.
fr: Par défaut, la DLL GDI installée.

source: True if the handle to opened GDI Dll is to be returned.
fr: True si le handle pour ouvrir la DLL GDI doit être retourné.

source: Default is False.
fr: Par défaut, False.

source: True or a handle to the opened GDI Dll if $bRetDllHandle = True.
fr: Retourne True ou le handle de la DLL GDI ouvert si $bRetDllHandle = True.

source: Call _GDIPlus_Startup() before you create any GDI+ objects.
fr: Appelez _GDIPlus_Startup() avant de créer tout objet GDI+.

source: Search GdiplusStartup in MSDN Library
fr: Consultez GdiplusStartup dans la Librairie MSDN.

source: Release a String Format object
fr: Libère un objet StringFormat

source: Handle to a String Format object
fr: Handle de l'objet StringFormat

source: Search GdipDeleteStringFormat in MSDN Library
fr: Consultez GdipDeleteStringFormat dans la Librairie MSDN.

source: Gets the number of measurable character ranges that are currently set for a StringFormat object
fr: Obtient le nombre de plages de caractères mesurables qui sont actuellement définies pour un objet StringFormat

source: Pointer to a StringFormat object
fr: Handle de l'objet StringFormat

source: the number of character ranges that can be measured.
fr: Retourne le nombre de plages de caractères qui peuvent être mesurées.

source: Search GdipGetStringFormatMeasurableCharacterRangeCount in MSDN Library
fr: Consultez GdipGetStringFormatMeasurableCharacterRangeCount dans la Librairie MSDN.

source: Measure first char (0-ased)
fr: Mesure premier caractère (de base 0)

source: Sets the text alignment of a string format object
fr: Définit la justification du texte d'un objet StringFormat

source: The string format object which is aligned
fr: Handle de l'objet StringFormat

source: The alignment can be one of the following:
fr: La justification peut être l'une des suivantes:

source: 0 - The text is aligned to the left
fr: 0 - Le texte est justifié à gauche

source: 1 - The text is centered
fr: 1 - Le texte est centré

source: 2 - The text is aligned to the right
fr: 2 - Le texte est jstifié à droite

source: Search GdipSetStringFormatAlign in MSDN Library
fr: Consultez GdipSetStringFormatAlign dans la Librairie MSDN.

source: Sets the line alignment of a StringFormat object in relation to the origin of a layout rectangle
fr: Définit l'alignement vertical de ligne d'un objet StringFormat par rapport à l'origine d'un rectangle de mise en page

source: Type of line alignment to use:
fr: Type d'alignement de ligne à utiliser:

source: 0 - Alignment is towards the origin of the bounding rectangle
fr: 0 - Alignement vertical à l'origine du rectangle délimitant

source: 1 - Alignment is centered between origin and the height of the formatting rectangle
fr: 1 - Centré entre l'origine et la hauteur du rectangle de mise en forme

source: 2 - Alignment is to the far extent (right side) of the formatting rectangle
fr: 2 - Alignement aussi bas que possible (coté droit) du rectangle de mise en forme

source: The line alignment setting specifies how to align the string vertically in the layout rectangle.
fr: Le réglage de l'alignement de ligne indique comment aligner verticalement la chaîne dans le rectangle de mise en page.

source: The layout rectangle is used to position the displayed string.
fr: La disposition du rectangle est utilisée pour positionner la chaîne affichée.

source: Search GdipSetStringFormatLineAlign in MSDN Library
fr: Consultez GdipSetStringFormatLineAlign dans la Librairie MSDN.

source: Sets a series of character ranges for a StringFormat object that, when in a string, can be measured
fr: Définit une série de plages de caractères pour un objet StringFormat qui, dans une chaîne, peuvent être mesurées

source: Array of character ranges:
fr: Tableau de plages de caractères :

source: [0][0] - Number of character ranges
fr: [0][0] - Nombre de plages de caractères

source: [1][0] - Character range 1 specifying the first position of range 1
fr: [1][0] - Plage 1, position (base 0) du premier caractère de la plage

source: [1][1] - Character range 1 specifying the number of positions in range 1
fr: [1][1] - Plage 1, nombre de caractères de la plage

source: [2][0] - Character range 2 specifying the first position of range 2
fr: [2][0] - Plage 2, position du premier caractère de la plage 2

source: [2][1] - Character range 2 specifying the number of positions in range 2
fr: [2][1] - Plage 2, nombre de caractères de la plage 2

source: [n][0] - Character range n specifying the first position of range n
fr: [n][0] - Plage n, position du premier caractère de la plage n

source: [n][1] - Character range n specifying the number of positions in range n
fr: [n][1] - Plage n, nombre de caractères de la plage n

source: Search GdipSetStringFormatMeasurableCharacterRanges in MSDN Library
fr: Consultez GdipSetStringFormatMeasurableCharacterRanges dans la Librairie MSDN.

source: Creates a TextureBrush object based on an image and a wrap mode
fr: Crée un objet TextureBrush à partir d'une image et d'un mode d'habillage

source: Wrap mode that specifies how repeated copies of an image are used to tile an area when it is
fr: Indique comment une image est disposée en mosaïque lorsqu'elle est plus petite que la zone à remplir:

source: a pointer to a new TextureBrush object.
fr: Retourne le handle du nouvel objet TextureBrush.

source: The size of the brush defaults to the size of the image, so the entire image is used by the brush.
fr: La taille du pinceau, par défaut, est celle de l'image, de sorte que la totalité de l'image est utilisée par le pinceau.

source: Search GdipCreateTexture in MSDN Library
fr: Consultez GdipCreateTexture dans la Librairie MSDN.

source: clear graphic handle with dark grey (background)
fr: Efface le handle Graphic avec du gris foncé (fond)

source: draw ellipse with texture as a brush
fr: Dessine une ellipse avec la texture du pinceau

source: Creates a TextureBrush object based on an image, a wrap mode and a defining rectangle
fr: Crée un objet TextureBrush à partir d'une image, d'un mode d'habillage et d'une définition de rectangle

source: Leftmost coordinate of the image portion to be used by this brush
fr: Coordonnée X la plus à gauche de la partie d'image qui doit être utilisée par ce pinceau

source: Uppermost coordinate of the image portion to be used by this brush
fr: Coordonnée Y la plus haute de la partie d'image qui doit être utilisée par ce pinceau

source: Width of the brush and width of the image portion to be used by the brush
fr: Largeur du pinceau et largeur de la partie d'image qui doit être utilisée par ce pinceau

source: Height of the brush and height of the image portion to be used by the brush
fr: Hauteur du pinceau et hauteur de la partie d'image qui doit être utilisée par ce pinceau

source: Search GdipCreateTexture2 in MSDN Library
fr: Consultez GdipCreateTexture2 dans la Librairie MSDN.

source: create texture brush only from a defined rectangle
fr: Crée un pinceau de texture seulement à partir d'un rectangle défini

source: Creates a TextureBrush object based on an image, a defining rectangle, and a set of image properties
fr: Crée un objet TextureBrush à partir d'une image, d'une définition de rectangle, et d'un ensemble de propriétés de l'image

source: Pointer to an image object
fr: Handle de l'objet Image

source: Pointer to an ImageAttributes object that contains properties of the image
fr: Handle de l'objet ImageAttributes qui contient des propriétés de l'image

source: Search GdipCreateTextureIA in MSDN Library
fr: Consultez GdipCreateTextureIA dans la Librairie MSDN.

source: capture the desktop and save it in memory in GDI format
fr: capturer le bureau et l'enregistrer dans la mémoire au format GDI

source: convert the GDI bitmap to GDI+ bitmap
fr: Convertir l'image bitmap GDI en bitmap GDI+

source: Local $iImgW = _GDIPlus_ImageGetWidth($hImage) ;get the width of the image
fr: $Locale = iImgW _GDIPlus_ImageGetWidth ($Himage); Obtient la largeur de l'image

source: Local $iImgH = _GDIPlus_ImageGetHeight($hImage) ;get the height of the image
fr: $Locale = iImgH _GDIPlus_ImageGetHeight ($Himage); Obtient la hauteur de l'image

source: create a GUI
fr: Crée une GUI

source: create a graphic object for displaying GDI+ graphics
fr: Crée un objet graphique pour l'affichage graphique GDI+

source: create a bitmap object based on a graphic object
fr: Crée un objet bitmap à partir d'un objet graphique

source: get the graphics context of the image / bitmap
fr: Obtient le contexte graphique de l'image/bitmap

source: create an empty bitmap (needed later for texture creating)
fr: Crée un bitmap vide (nécessaire plus tard pour créer la texture)

source: get the graphic context of the image / bitmap
fr: Obtient le contexte graphique de l'image/bitmap

source: copy the image into the empty bitmap
fr: Copie l'image dans le bitmap vide

source: release graphic context handle
fr: Libére le handle du contexte graphique

source: release image handle
fr: Libère le handle de l'image

source: create and initializes a scaling color matrix (5 x 5 homogeneous matrix for a 4-space transformation) -> see http://msdn.microsoft.com/en-us/library/windows/desktop/ms533875(v=vs.85).aspx
fr: Crée et initialise une matrice couleur de mise à l'échelle (matrice 5 x 5 homogène pour une transformation dans l'espace de dimension 4) -> voir http://msdn.microsoft.com/en- us/Librairie/windows/desktop/ms533875(v=vs.85).aspx

source: create an image attribute object (needed for color manipulation)
fr: Crée un objet d'attributs d'image (nécessaire pour la manipulation des couleurs)

source: create $g_iTiles * $g_iTiles small bitmaps (tiles) to fill it up with parts of the captured image
fr: Crée $g_iTiles * $g_iTiles de petites images bitmaps (pavés) pour remplir avec des parties de l'image capturée

source: adjust the ImageAttribute color matrix for each bitmap
fr: Ajuste la matrice couleur ImageAttribute pour chaque bitmap

source: creates a texture brush object based on an image with changed image attributes
fr: Crée un objet TextureBrush à partir d'une image avec des attributs d'image modifiées

source: draw rectangle filled with manipulated tile of the image to the bitmap
fr: Dessine un rectangle rempli avec des pavés manipulée de l'image dans le bitmap

source: release texture
fr: Libére la texture

source: releases the image attributes object
fr: Libère l'objet ImageAttributes

source: Clears a graphic object to a specified color
fr: Efface l'objet graphique avec une couleur spécifiée

source: move each tile to its new position
fr: Déplace chaque mosaïque à sa nouvelle position

source: bitmap handle
fr: Handle de bitmap

source: width
fr: largeur

source: height
fr: hauteur

source: draw complete drawn image into GUI
fr: Dessine l'image complète dans la GUI

source: clean up resources
fr: Nettoie les ressources

source: False - i, v, x ... in $sStyle is letter i, v, x ...
fr: in $sStyle is letter i, v, x ...

source: Disable "Find..." and "Replace..." menu items, otherwise, the script maay crash
fr: Disable "Find..."

source: Enable "Find..." and "Replace..." menu items
fr: Enable "Find..."and "Replace..."

source: [optional][optional]
fr: [optional] [optional] The PID of the process.

source: The PID of the process.Default (0) is the current process.
fr: Default (0) is the current process.

source: Calculates the absolute value of a number.
fr: Calcule la valeur absolue d'un nombre.

source: Any valid numeric expression.
fr: Toute expression numérique valide.

source: Returns absolute value of expression.
fr: Retourne la valeur absolue de l'expression.

source: A string has a value of zero.
fr: Une chaîne de caractères donne zéro pour valeur.

source: Assign a Local variable an absolute number.
fr: Assigne une variable locale avec la Valeur Absolue d'un nombre.

source: Calculates the arcCosine of a number.
fr: Calcule l’arc-cosinus d'un nombre.

source: Any value between -1 and 1 inclusive.
fr: Tout nombre compris entre -1 et 1 inclus.

source: Returns the trigonometric arccosine of the number.
fr: Retourne l’arc-cosinus trigonométrique du nombre.

source: Result is in radians.
fr: Le résultat est exprimé en radians.

source: ACos(x) is mathematically defined only for -1 < x < 1, so ACos() tends to return -1.#IND for other values of x.
fr: ACos(x) est défini mathématiquement pour -1 < x < 1, aussi ACos retourne -1.#IND (indéterminé) pour toutes les autres valeurs de x.

source: Assign a Local variable the arcCosine of 0.5.
fr: Assigne une variable locale avec l'arc cosinus de 0,5.

source: Display the result.
fr: Affiche le résultat.

source: Assign a Local constant variable the approximate PI number.
fr: Assigne une constante locale avec le nombre PI.

source: Assign a Local variable the formula to switch from radian to degree (equals to one radian in degree).
fr: Assigne une variable locale avec la formule de convertion des radians en degrés (valeur de un radian en degrés).

source: Assign a Local variable a number in degree.
fr: Assigne une variable locale avec un nombre en degrés.

source: Example of using ACos with degrees.
fr: Exemple d'utilisation avec ACos degrés.

source: Registers an Adlib function.
fr: Enregistre une fonction AdLib.

source: The name of the adlib function to be registered.
fr: Le nom de la fonction adlib qui doit être enregistrée.

source: how often in milliseconds to call the function.
fr: Nombre de millisecondes entre chaque appel de la fonction.

source: Default is 250 ms.
fr: Valeur par défaut :250 ms.

source: Every 250 ms (or time ms) the specified "function" is called--typically to check for unforeseen errors.
fr: La fonction spécifiée est appelée toutes les 250 ms (ou time ms), typiquement pour vérifier la présence d'erreurs.

source: For example, you could use adlib in a script which causes an error window to pop up unpredictably.
fr: Par exemple, vous pouvez utiliser adlib dans un script faisant apparaitre un pop-up d'erreur aléatoire.

source: The adlib function should be kept simple as it is executed often and during this time the main script is paused.
fr: La fonction adlib doit être le plus simple possible car elle est exécutée souvent et que pendant son temps d’exécution le script principal est mis en pause.

source: Also, the time parameter should be used carefully to avoid CPU load.
fr: De plus, le paramètre 'time' doit être utilisé prudemment pour éviter une surcharge du processeur.

source: You can not register a function using parameters.
fr: Vous ne pouvez pas enregistrer une fonction qui a es paramètres.

source: Several Adlib functions can be registered.
fr: Plusieurs fonctions adlib peuvent être enregistrées.

source: Re-registering an already existing Adlib function will update it with a new time.
fr: Le ré-enregistrement d'une fonction adlib la mettra à jour avec son nouveau paramètre 'time'.

source: Register the function MyAdLibFunc() to be called every 250ms (default).
fr: Enregistre la fonction MyAdLibFunc() qui sera appelée toutes les 250ms (par défaut).

source: Sleep does not stop AdLib functions from running.
fr: Sleep n'arrête pas les fonctions AdLib en cours d'exécution.

source: AdLib functions don't run while a blocking function is shown e.g.MsgBox, InputBox, WinWait, WinWaitClose etc.
fr: Les fonctions AdLib ne s'exécutent pas tant que une fenêtre bloquante est affichée, par exemple MsgBox, InputBox, WinWait, WinWaitClose, et...

source: The AdLib function MyAdLibFunc() will start again.
fr: La fonction AdLib:MyAdLibFunc() va redémarrer.

source: Unregister the function MyAdLibFunc() from being called every 250ms.
fr: Annule l'enregistrement de la fonction MyAdLibFunc() pour être appelée toutes les 250ms.

source: Assign a static variable to hold the number of times the function is called.
fr: Assigne une variable statique pour contenir le nombre de fois où la fonction est appelée.
